Revit 2027 API
ExporterIFC.GetHostObjects Method
 Returns a collection containing the host object handles in the document.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IDictionary<ElementId, IFCAnyHandle>> GetHostObjects()
Public Function GetHostObjects As IList(Of IDictionary(Of ElementId, IFCAnyHandle))
public:
IList<IDictionary<ElementId^, IFCAnyHandle^>^>^ GetHostObjects()
member GetHostObjects : unit -> IList<IDictionary<ElementId, IFCAnyHandle>>
Return Value
IList<IDictionary<ElementId, IFCAnyHandle>>
 The collection of host objects.
Remarks
 Host object handles is currently collected by RegisterSpaceBoundingElementHandle and exporting internal element and cached in the ExporterIFC object. This method returns the cached information which is needed to create wall connectivity objects.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace